[
  {
     "name": "personnage1",
     "user": [
       {
        "email": "lesgouvernertous@mordor.com",
        "username": "Sauron",
        "password": "anneauUnique"
       }
     ],

     "guest": [
       {
         "email": "vecna1@donjonsql.com",
         "username": "vecna1",
         "password": "archiliche",
         "isguest": false
       }
     ],

     "race": [
       {
        "name" : "Drakéide" ,
        "speed": "9 m",
        "score_modifier": [
          {
          "name": "force",
          "number": 2
          },
          {
          "name": "charisme",
          "number": 1
          }
        ],
        "language": ["commun", "draconique"],
        "extra_language": 0,
        "racial_ability": [
          {
            "name": "ascendance draconique",
            "description": "Vous avez une ascendance draconique. Votre souffle et votre résistance aux dégâts sont déterminés par le type de dragon.",
            "choice": ["Or","Argent","cuivre"]
          }
        ],
        "night_vision": false 
       }
     ],

     "class": [
       {
        "name" : "Guerrier" ,
        "hit-point": 10,  
        "proficiencies": [
          {
            "name": "guerrier",
            "saving_throw": [
              {
              "name": "force"
              },
              {
                "name": "constitution"
              }
            ],
            "skills": [
              {
                "name": "intimidation"
              },
              {
                "name": "accrobaties"
              }
            ],
            "features": [
              {
                "name": "style de combat",
                "description": "Vous adoptez un style particulier de combat qui sera votre spécialité.",
                "features_choice": [
                  {
                  "name":"armes à deux mains",
                  "description":"Lorsque vous obtenez 1 ou 2 à un dé de dégâts lors d’une attaque que vous effectuez avec une arme de corps à corps que vous tenez avec vos deux mains, vous pouvez relancer le dé et obligatoirement prendre le nouveau résultat, même si celui-ci est un 1 ou un 2. L’arme doit avoir la propriété à deux mains ou polyvalente pour octroyer cet avantage."
                  },
                  {
                    "name": "combat à deux armes",
                    "description": "Lorsque vous vous engagez dans un combat avec deux armes en mains, vous pouvez ajouter votre modificateur de caractéristique aux dégâts de la seconde attaque."
                  }
                ]
              }
            ]
          }
        ]
       }
     ],

     "ability_score": [
       {
         "strength": 1,
         "dexterity": 1,
         "constitution": 1,
         "wisdom": 1,
         "charisma": 1,
         "intelligence": 1
       }
     ],

     "background":[
       {
        "name": "acolyte",
        "additional_language" : 2,
        "skills": [
          {
            "name": "intuition"
          },
    
          {
            "name": "religion"
          }
        ],
        "ability": "En tant qu’acolyte, vous imposez le respect à ceux qui partagent votre foi, et pouvez mener les cérémonies religieuses de votre divinité. Vous et vos compagnons aventuriers pouvez vous attendre à recevoir des soins gratuits dans un temple, un sanctuaire ou toute autre présence établie de votre foi, bien que vous soyez responsable de fournir toutes les composantes matérielles nécessaires aux sorts. Ceux qui partagent votre religion vous aideront (mais seulement vous) et vous offriront un mode de vie modeste. Vous pouvez également avoir des liens avec un temple spécifique dédié à votre divinité ou votre panthéon, et vous y avez une résidence. Cela pourrait être le temple où vous avez servi, si vous êtes resté en bons termes avec lui, ou un temple dans lequel vous avez trouvé une nouvelle maison. Lorsque vous êtes proche de votre temple, vous pouvez faire appel à des religieux pour vous aider, à condition que l’aide que vous demandiez ne soit pas dangereuse et que vous restiez en règle avec votre temple."    
       } 
     ]
  },

  {
    "name": "personnage2",
       "user":[
         {
          "email": "datasensei@yamete.com",
          "username": "BenOclock",
          "password": "N0C0DEmustdie!"
         }
       ],
    
    "guest": [
      {
        "email": "vecna2@donjonsql.com",
        "username": "vecna2",
        "password": "archiliche",
        "isguest": false
      }
    ],   

    "race": [
      {
        "name" : "Humain",
        "speed": "9 m",
        "score_modifier": [
          {
            "name": "force"  ,
            "number": 1 
          },
          {
            "name": "dextérité",
            "number": 1
          },
          {
            "name": "constitution",
            "number": 1
          },
          {
            "name": "sagesse",
            "number": 1
          },
          {
            "name": "charisme",
            "number": 1
          },
          {
            "name": "intelligence",
            "number": 1
          }
      ],
      "language": ["commun"],
      "extra_language": 1,
      "racial_ability": [],
      "night_vision": false
      }
    ],

    "class": [
      {
        "name" : "paladin" ,
        "hit-point": 10,  
        "proficiencies": [
        {
        "name": "paladin",
        "saving_throw": [
          {
            "name": "sagesse"
          },
          {
            "name": "charisme"
          }
        ],
        "skills": [
          {
            "name": "athlètisme"
          },
          {
            "name": "religion"
          }
        ],
        "features": [
            {
              "name": "sens divin",
              "description": "Par une action, jusqu’à la fin de votre prochain tour, vous connaissez l’emplacement de toute créature céleste, fiélon ou mort-vivante dans un rayon de 18 mètres autour de vous, et qui ne se trouve pas derrière un abri total. Vous connaissez le type (céleste, fiélon ou mort-vivant) et le nombre de tous les êtres dont vous sentez la présence, mais pas leur identité. Dans ce même rayon, vous détectez également la présence d’un lieu ou d’un objet qui a été consacré ou profané, comme avec le sort sanctification.",
              "number_of_use": "1 + modificateur de charisme",
              "reset": "Long repos"
            },
            {
              "name": "imposition des mains",
              "description":"Votre toucher béni peut guérir les blessures. Avec cette réserve, vous pouvez restaurer un nombre total de points de vie égal à votre niveau de paladin multiplié par 5. Au prix d’une action, vous pouvez toucher une créature et puiser dans votre réserve pour soigner autant de points de vie que vous le désirez, sans dépasser le nombre de points dans votre réserve bien entendu. Vous pouvez également dépenser 5 points de vie de votre réserve pour guérir la cible d’une maladie ou neutraliser un poison qui l’affecte. Vous pouvez soigner plusieurs maladies et neutraliser plusieurs poisons avec une seule imposition des mains en dépensant les points de vie séparément pour chacun d’entre eux. L’imposition des mains n’a pas d’effet sur les morts-vivants et les artificiels.",
              "number_of_use": "5",
              "reset": "Long repos"
            }
        ]
      }
    ]
      }
    ],

    "ability_score": [
      {
        "strength": 1,
        "dexterity": 1,
        "constitution": 1,
        "wisdom": 1,
        "charisma": 1,
        "intelligence": 1
      }
    ],

    "background": [
      {
        "name": "criminel",
        "skills": [
          {
            "name": "discrétion"
          },
    
          {
            "name": "tromperie"
          }
        ],
        "ability": "Vous avez un contact fiable et digne de confiance qui agit comme votre agent de liaison avec un réseau d’autres criminels. Vous savez comment envoyer et recevoir des messages via votre contact, même sur de grandes distances. Concrètement, vous connaissez les messagers locaux, les maîtres de caravanes corrompus et les marins miteux qui peuvent délivrer des messages pour vous."
      }
    ]

  }

]